{"translation": {"source": "Clay: Pliable earth that hardens when fired", "target": "Odo: Ilẹ tó ṣeé tẹ, tó sì má nda líle tí a bá sun ún ní iná"}}
{"translation": {"source": "Rock ", "target": "Àpáta "}}
{"translation": {"source": "A living thing is something that is alive It is not an object and it is not dead Animals are living things that can move around, eat food for fuel, and reproduce.", "target": "Èdá oníyè jẹ́ nkan tó wà l’áàyẹ̀. Kì i ṣe nkan lásán, béẹ̀ ni kò kụ́  Èdá àìníyè jẹ́ nkan tí kò wà láàyè rí tàbí tó ̣ tí wà láàyè télẹ̀ ṣùgbọ́n tó ̣tí kú.   Àwọn ẹran jé ̣èda oníyè tó ní agbára láti rìn ̣ kiri, láti lo onjẹ gég̣ ébí ̣ohun afúnnilókun, àti láti bí irú ara wọn."}}
{"translation": {"source": "Seismology Science of earthquakes", "target": "Ẹ̀kọ́ nípa ìjì-ilẹ"}}
{"translation": {"source": "Many processes such as landslides, earthquakes, floods and volcanic eruptions can be hazardous to people. Geologists work to understand these processes well enough to avoid building important structures where they might be damaged.", "target": "ọpọlọpọ àwọn ìrírí ayé bí ilẹ-yíyọ̀, ìjì-ilẹ, àgbàrá-òjò àti ìfẹilẹ ló ní ọpọlọpọ ewu fún àwa ọmọ aráyé. Àwọn akè ̣kọ́ iṣè ̣dálẹ-ayé nṣiṣé ̣ láti lóye àwọn nkan wọnyí tóbẹẹ gẹ kí a ba lè yàgò fún kíkọ àwọn ilé pàtàkì ní ibi tí wọn ti lè bàjẹ."}}
{"translation": {"source": "Earthquake Shaking of the earth’s crust", "target": "Ìjì-ilẹ"}}
{"translation": {"source": "Respiration:  Living things break down food within their cells to release energy ", "target": "Ìpòyìdà: Àwọn èdạ́ oníyè a máa fó onjẹ sí ẉéẉé nínú pádi wọn láti ṣe ìmúlò agbára àwọn onjẹ yi."}}
{"translation": {"source": "Movement: All living things move.", "target": "Ìpapòdà: Gbogbo àwọn èdạ́\toníyè ni wóṇ npa ipò dà "}}
{"translation": {"source": "Whilst many other things carry out one or more of the above processes, only living organisms possess all of these characteristics.", "target": "Bótilèjẹ́ pẹ́ a rí àwọn èdạ́ àìníyè tó le ṣe àwọn kan nínú àwọn nkan wònyị́. Àwọn èdạ́ oníyè nikan ló ní gbogbo àwọn ìṣesí yi."}}
{"translation": {"source": "Sedimentary rock: Rock formed from the deposit of sediments", "target": "Àpáta ìsilẹ: Àpáta tó wáyé nigbati awọn gè ̣dè ̣gé ̣dè ̣ ile bá kóra jọ ti wọn sì di líle"}}
{"translation": {"source": "Sand: granular material of disintegrated rock", "target": "Yanrìn, Iyanrìn: Àpáta tẹlẹ tó ti wá di ewówó, tó sì ti túká."}}
{"translation": {"source": "Metamorphic rock: from the transformation of existing rock types", "target": "Àpáta ìpààrídà: Àpáta tó wáyé lati ara apata miran"}}
{"translation": {"source": "It is knowledge gained by the observation, identification, description, experimental investigation, and theoretical explanation of phenomena.", "target": "Ó jé ̣ìmò ̣tí a jèrè nípa àkíyèsí, ìfihàn, ìjúwe, ìwádi-pèlụ́ àṣewò, àti àlàyé pèlụ́ ọgbóṇ -orí àwọn ohun ìrúnilójú tàbí àgbàyanu"}}
{"translation": {"source": "It includes botany and zoology and all their subdivisions.", "target": "Èyí jé àpap̣ò ̣èkọ́ nípa ògbìn ̣àti èkọ́ nípa ẹran, àti gbogbo àwọn èka wọn."}}
{"translation": {"source": "Machine: a device that manages power to accomplish a task", "target": "Èrọ̣: Oun tí a dá tàbí tí a rọ láti fi lo  ìgbóra fún iṣé ̣ṣíṣe"}}
{"translation": {"source": "GEOLOGY", "target": "Ẹ̀KỌ́ ÌṢẸ̀DÁLẸ̀ -AYÉ"}}
{"translation": {"source": "Growth: Growth is seen in all living things. It involves using food to produce new cells.", "target": "Ìdàgbàsónlò Gbogbo èdạ́ oníyè ni a nri pé wóṇ ndàgbàsókè. Wóṇ má nlò onjẹ láti dá àwọn pádi tuntun."}}
{"translation": {"source": "Biology: a natural science concerned with the study of life and living organisms, including their structure, function, growth, origin, evolution, distribution, and taxonomy.", "target": "Èkọ́ ̣èdạ́-oníyè: èkọ́ ̣ìmò-̣ jinlè ̣nípa àwọn èdạ́ gbogbo tó ní ìyè, ní pàtàkì, ètò-inú, ìlò, ìdàgbàsókè, ìṣèdạ́, ìtìranyà, ìpínkáàkiri, àti ìkàsí wọn."}}
{"translation": {"source": "Minerals: Minerals are naturally occurring useful substances that are neither plants nor animals", "target": "Àlùmọnì: Àwọn eléyi jé ̣ àwọn nkan tó ti wà láti ayébáyé, tí wọn sì ní ìwúlò. Àwọn eléyi kì íṣe onjẹ tàbí àwọn ẹran."}}
{"translation": {"source": "Technology: a body of knowledge used to create tools, develop skills, and extract or collect materials. It is also the application of science (the combination of the scientific method and material) to meet an objective or solve a problem.", "target": "Èkọ́ ̣ìmò-̣ èrọ̣ : jé ̣ìmò ̣tí a fi nṣèdá àwọn ̣ irinṣé, ̣ tí a fi ngòkè nínú ìmòṣẹ , tí a fi nfa tàbí ṣàkójọ àwọn nkan. Èkọ́ ̣ìmò-̣ èrọ sì jẹ́ ọ̀ nà ìmúlò ẹ̀ kọ́ ̣ìmò-̣ jinlè ̣ (Àpapò ìlànà ̣ ìmò-̣ jinlè àti ouṇ -èlò) láti ṣe ojútùú ìyọnu tàbí láti ṣèwádi àwọn ohun ìrújú."}}
{"translation": {"source": "INTRODUCTION", "target": "Ọ̀RỌ̀ ÀKỌ́SỌ"}}
{"translation": {"source": "Living things need air, food and water to stay alive. These are basic needs.", "target": "Àwọn èdạ́ oníyè nílò atégùṇ, onjẹ àti omi láti wà láàyè. Àwọn eléyi ló jé kòṣeémánị"}}
{"translation": {"source": "Geology - Science of the earth: is the science comprising of the study of solid Earth and the processes by which it evolves.", "target": "Ẹ̀kọ́ Ìṣè ̣dálẹ-ayé jé ̣ è ̣kọ́ nípa orílẹ ayé àti gbogbo àwọn ọnà tí ó gbà yà."}}
{"translation": {"source": "A is approximately equal to B. A is not equal to B but it is almost the same as B", "target": "Iye A pé iye B. A kìí ṣe iyekan pèlú B, ṣùgbóṇ ó pé ̣ iye B"}}
{"translation": {"source": "In modern times, geology is commercially important for mineral and hydrocarbon exploration and for evaluating water resources; is publicly important for the prediction and understanding of natural hazards.", "target": "Ní àsìkò ìlàjú yi, è ̣ kó ̣ ìṣè ̣ dálẹ-ayé jé ̣ pàtàkì fún àmúṣọrọ àwọn àlùmọnì ilẹ ayé àti fún ìwákiri àwọn epo rọbì, àti fún àgbéyẹwò àwọn ọrọ inú omi. Ó tún wà fún iṣàsọtẹlẹ àti ìlanilóye àwọn ewu ilẹ ayé."}}
{"translation": {"source": "Cell: Fundamental structural unit of plants and animals.", "target": "Pádi: Ìpilèṣẹ̀ ẹyọ ètò-inú àwọn ògbìn àti ẹran."}}
{"translation": {"source": "Plants are also living things that usually make their own food, reproduce, but cannot move around", "target": "Àwọn ògbin náạ̀ jé ̣ohun oníyè tí wón ntìkara wọn ṣe onjẹ. Wón sì lè bí irú ara wọn, ṣùgbón wọn kò lè rìn kiri"}}
{"translation": {"source": "Science: the study of the structure and function of living and non-living matter.", "target": "Èkọ́ Ìmò-̣ jinlè:̣ èkó ètò-inú àti ìlò àwọn àìdá oníyè àti àwọn àìdá àìníyè"}}
{"translation": {"source": "Nutrition: Living things take in materials from their surroundings that they use for growth or to provide energy.  ", "target": "Ìjẹèmuṇ: Àwọn èdạ́ oníyè a má wá oun jíjẹ àti mímu ní àgbègbè wọn tí wóṇ nlò fún ìdàgbàsókè àti fún ìpèsè agbára. "}}
{"translation": {"source": "Sandstone: sedimentary rock with colour ranging from yellow to red", "target": "Egúrù, egúnrìn: Àpáta ìsìlẹ tó ní àwọn awọ bí àyìnrín sí pupa"}}
{"translation": {"source": "Add A to B or Add B to A", "target": "Ṣàròpò ̣A àti B"}}
{"translation": {"source": "OTHER MATERIALS OBTAINED FROM THE GROUND", "target": "ÀWỌN OHUN AJÉ MIRÀN TÍ A NRI NINU ILẸ"}}
{"translation": {"source": "Kingdoms - according to their appearance and behavior", "target": "Ìjọ - gégẹ́ bị́ ìrísí àti ìṣèwàhù wọn"}}
{"translation": {"source": "A is similar to B ", "target": "A àti B bárajọ "}}
{"translation": {"source": "Volcano (volcanic eruption) A vent in the earth’s crust through which lava and ashes  are expelled.", "target": "Ìfẹ-ilẹ (ilẹ fẹ: the earth vents): ìfẹ láti inú ilẹ wá tó nfa ki ọgọdọ-gbígbóná àti eérú tu jáde"}}
{"translation": {"source": "Excretion: All living things excrete. As a result of the many chemical reactions occurring in cells, they have to get rid of waste products which might poison the cells.", "target": "Ìkégbin:  Gbogbo èdá oníyẹ̀ni wóṇ nṣe ìkégbiṇ ara wọn. Titóríti àsè àwọn ẹlà tó nṣẹlè ̣nínú àwọn pádi wònyi, ẉón nị́láti wá ònà lạ́ti kó ègbin tó j̣é ̣èsụ́ n àwọn àsè yi. Bí béẹ̀ ḳ ó, wọn lè di nkan olóró fún àwọn pádi fúnra wọn."}}
{"translation": {"source": "Igneous rock: Rock produced by the action of fire", "target": "Àpáta àfinádá: Àpáta tó wáyé nigbati ọ̀gọ̀dọ̀ gbigbona tó jade lati àjà-ilè ̣ di tútù"}}
{"translation": {"source": "Non-living things: do not have most of the characteristics of living things", "target": "Àwọn àìdá-àìníyè:  Wọn kò ní òpọ̀ lọ́ pọ̀ ̣ àwọn ìfihàn àwọn àìdá-oníyè (èdạ́ )"}}
{"translation": {"source": "Seven activities which make organisms different from non-living things:", "target": "Àwọn ìṣesí méje tó nṣe ìdáyàtò ̣láarín èdá oníyè àti èdá àìníyẹ̀:"}}
